#ifndef koreanTestVectors_hpp
#define koreanTestVectors_hpp

#include <vector>
#include "testData.hpp"

const std::vector<testData> koreanTestVectors = {
    {
     "ffffffffffffffffffffffffffffffff",
     "힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 흑백",
"ed94f57066db1a769b31a7e2910df939574d8c9d8cf76370bd457d7a377bf8e0bf4647b4697b607daa9e7c268e7d04ee51c6f026060a697e012d8e5ba9373d53",
     "",
    },
    {
     "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
     "힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 허용",
"5421e2f8b1889b2f4edd8d9fc14ba6d82908dce4b869d216fe411abfc0c270e789681a1815213aa1963f9d1d2fecd000800af0b21620bd986c36e1f7090fb50b",
     "",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a7232",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 색깔",
"41760a5160763a57eac5613b76b728646c49fd7f18187fec7469e8742219ed01a60d0c308b874decff4e73653683544789e8d5bb7254792afbce53573ec8de10",
     "",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a72328a9b773c",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한눈",
"4a13c9bab38f0e17022d8189ed16c6b41a207d926dd6052258d2a3e37034031dbc14cfa1dcc776b71dc28e58731857833941956429af0270030e84485e0f01ab",
     "",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 참기름",
"bd85a4aa4426f7eb867cabb7accfd9da57d7639384d288ae33c35fcf800a0cbb75ea9cc302c40511594e4e047b419f8110ac0a425ca938735357c8d09b13111d",
     "",
    },
    {
    "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a59fc8d3a",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 처음 실습 권위 이렇게",
"226ce48f94f2021bb62c8dc619b16c0d8e7aa226e72cedafec1cded879e52c7f8e0d0aa42fc3ef915099cdaeb83418d205bac46f94f3d63cebeb8930b9d0a4a4",
     "",
    },
    {
    "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a59fc8d3a659fc8d3",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 처음 실습 권위 이민 참가 깨소금 실질적",
"fb4315babc23ac65b4e36250c7fd1768e276b546aaf000b8d92895a0642eb0bffd61839283d5929b8b7dfc7aa24685bebdf23e8a4832beb91c2041fe462c4dbf",
     "",
    },
    // with passphrase
    {
     "ffffffffffffffffffffffffffffffff",
     "힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 흑백",
"b6eb986d6aaf7d0cd0eae2a667ff8bde68c8780fb5a728cf500e29119ce99c9b079a4217836879c1e73b8a85422a85b564d819699a4310a1d007b5be24c24b6d",
     "TREZOR",
    },
    {
     "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
     "힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 힘껏 허용",
"340bd57209e54e8bde6ca750147933f7e44995047da87b61f64f70f26f289a377e25a65f5efb11f9e651917ec9866d54846516ae0fba956f5f536422bb47d91c",
     "TREZOR",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a7232",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 색깔",
"44f2eb69eadeec95372917ead49183beeee8f06110cb7309b7cd05a8234ea6102d38855027aba065656c500fc31ac395c168f0da22adefdf6b664465a2892d8b",
     "TREZOR",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a72328a9b773c",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한눈",
"ca1b607ebd6e852041ab27c34ce561fe7a415c30c2db68d8dbfad65d08d93a973952d0d7164c317b3d4136dd3dfbe590d21b084f8fd78ea7776fa6e5ab135562",
     "TREZOR",
    },
    {
     "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 참기름",
"f105bb807c00511503224d4c3780bf1204043d7574fbd66844f3f6459d1babfcc14d8bf8606ff88745bde03f5e36d43bc8ef92bb5b7f12f5af966b4fe6490381",
     "TREZOR",
    },
    {
    "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a59fc8d3a",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 처음 실습 권위 이렇게",
"9afd46e23518383211d9f22a0c59d8fe924c247b82a6837e45f04dab382b2ba45270c86e0a7d6c880cac05895da09cf0dd8298b4eb43a5a294967b7b6f730270",
     "TREZOR",
    },
    {
    "8a9b773c1fd81872659fc8d3a99a72328a9b773c59fc8d3a59fc8d3a659fc8d3",
     "얼핏 칠십 차림 무관심 씨름 맘대로 오른발 호흡 철저히 백성 우승 생선 인물 절약 한여름 몹시 여론 처음 실습 권위 이민 참가 깨소금 실질적",
"72e1cb95fbb1d5d083e92379e56fca3cfe99929c889c635b25e2f6541aa13bb9af89894b406f6914c70e203a90928ee78141549efd96342aaa16ef613b60061e",
     "TREZOR",
    },
};

#endif
